namespace UTH.Framework
{
    /// <summary>
    /// 编码Code
    /// </summary>
    public enum EnumCode
    {
        成功 = 0,
        提示消息 = 10000,
        未知异常 = 10001,
        参数异常 = 10002,
        初始失败 = 10003,
        配置异常 = 10004,
        网络异常 = 10005,
        校验失败 = 10006,
        路径错误 = 10007,
        不支持Http = 10008,
        不支持Cookie = 10009,

        认证错误 = 10101,
        认证失败 = 10102,
        认证过期 = 10103,
        授权失败 = 10104,
        暂无权限 = 10105,
        授权文件 = 10106,

        数据库执行异常 = 10200,
        数据库查询异常 = 10201,
        数据库事务异常 = 10202,

        服务异常 = 10300,
        多线程异常 = 10301,
        注册表异常 = 10302,

        不允许移至子节点 = 90101,
    }
}
